[{"title": "Tic Tac", "date": "2018-10-10T00:00:00Z", "items": ["Launched \"Tic Tac! The Classic Predecessor to Tic Tac Toe!\""]}, {"title": "Grades Shortcut", "date": "2018-10-13T00:00:00Z", "items": ["Added Shortcut to get summary of grades", "Added Contact Information"]}, {"title": "Grades on Seperate Server", "date": "2018-10-16T00:00:00Z", "items": ["Moved Grade Checker to Digital Ocean Droplet at [https://grades.katzrkool.xyz](https://grades.katzrkool.xyz)"]}, {"title": "Fixed Menu Checker Bugs & Grade Checker Privacy", "date": "2018-10-19T00:00:00Z", "items": ["Fixed bug where some elements wouldn't move properly if user was trying to access the previous week", "Fixed bug where if menu information wasn't available, the site would crash", "Updated Privacy Policy for Grade Checker to be more thorough"]}, {"title": "Added Data Point about Missing Assignments", "date": "2018-10-23T00:00:00Z", "items": ["Added Data Point that states the user's grade if the missing assignments were not counted against them"]}, {"title": "Made Adjustments and Fixes to Grade Checker", "date": "2018-10-28T00:00:00Z", "items": ["An 89.5 and above is an A, a 79.5 and up is a B, etc", "The \"How many points can you afford to lose\" didn't take missing grades into account, now it does", "Changed the color for a B to a less harsh color"]}, {"title": "Grade Checker Changes and FAQ", "date": "2018-10-30T00:00:00", "items": ["The default score ignores missing assignments, to mimic myBackpack", "Changed the \"grade without missing\" stat to \"grade with missing\" stat.", "Added an [FAQ!](https://grades.katzrkool.xyz/faq)", "Made the JS prettier :)"]}, {"title": "Spooky Halloween Redesign", "date": "2018-10-31T00:00:00Z", "items": ["Website Redesigned!", "Gave Shortcuts its own section", "Put a nifty disclaimer on the grade site about the dangers of weighted grades", "Grade checker presents the grade mybackpack presents"]}, {"title": "Removed Feature because of the myBackpack", "date": "2018-11-02T00:00:00Z", "items": ["Since we're using the myBackpack grade for the total now, the \"if we counted missing assignments, you would have an F\" feature isn't relevant."]}, {"title": "Menu & Grades updates", "date": "2018-12-10T00:00:00Z", "items": ["Menu now uses an sqlite3 database instead of a JSON file. Performance is up", "As a side effect of the database change, the menu now won't delete old data, historical data will be available from December 2018. Possibly extending later", "Grade Checker now has a nifty analytic that reads something like \"You've earned 154.0 points out of 175.0 points. 154.0 / 175.0 = 0.88\" for every subject. It should help anyone wanting to do manual calculations.", "The Grade Checker api endpoint is now at /api", "Menu now says how many times chicken has been served on days that serve chicken."]}, {"title": "Kahoot & new domain", "date": "2018-12-16T00:00:00Z", "items": ["Made a Kahoot keyboard shortcut extension for Firefox. Available on the [Mozilla Addons Store](https://addons.mozilla.org/en-US/firefox/addon/kahoot-keyboard-shortcuts/)", "Changed domain name from katzrkool.xyz to lkellar.org . All services have been moved and all katzrkool.xyz links will redirect until July (when the domain expires).", "Email address on the main page has changed from admin@katzrkool.xyz to [lucas@lkellar.org](mailto:lucas@lkellar.org)", "Menu & Grade shortcuts have been updated to support new domain. More information available at the shortcuts page.", "Fixed bug where menu was slow for the first user every day."]}, {"title": "2019 Rollover Update", "date": "2019-01-05T00:00:00Z", "items": ["Moved grades.lkellar.org to new server.", "Grades will tell you when your password is incorrect, instead of the blank gray screen of nothingness.", "Grades analytics have been temporary removed, because I have to test them with semester 2 data, but they'll be back next Monday (2018-01-14)", "Grades api has changed a bit, see [Github](https://github.com/katzrkool/backpack) for more info", "Made updates to Menu to ensure the data are updated on time"]}, {"title": "Grades Semester 2 Update", "date": "2019-01-12T00:00:00Z", "items": ["Assignments from different semesters are separated by a line", "Analytics are only calculated for second semester (because I was told semester 1 and 2 were separate)", "Added a Expand/Collapse button", "Grades now optimized for mobile view", "[Grades Test page](https://grades.lkellar.org/test) updated for semester 2"]}, {"title": "Added myBackpack Error Page", "date": "2019-01-16T00:00:00Z", "items": ["Grades now detects when myBackpack breaks, and informs the user appropriately"]}, {"title": "Added date param to menu", "date": "2019-01-20T00:00:00Z", "items": ["The Menu api now has a date parameter that replaces the old days param. Clients can pass either a date in the yyyy-mm-dd format or a number of days to skip ahead. See the [api documentation on Github](https://github.com/katzrkool/menu#api) for more info"]}, {"title": "Made Grades Better", "date": "2019-01-22T00:00:00Z", "items": ["If a teacher put in one assignment, worth zero points, grades would crash because it would try to get the average, but it would divide by zero and crash. That was fixed", "If it breaks, myBackpack breaks, or you break it, you'll be better informed on what happened"]}, {"title": "Added Dark mode", "date": "2019-01-27T00:00:00Z", "items": ["Added dark mode to the main site, menu, and grade checker", "To activate, tap the \"activate dark mode\" button on the main page", "Once activated, your preference is remembered with a cookie, so you don't have to switch it manually all the time", "If your browser and operating system supports dark mode for websites via the \"prefers-color-scheme\" media query (currently macOS Mojave with Safari Technology Preview), it'll auto switch"]}, {"title": "Dark Mode Update", "date": "2019-02-22T00:00:00Z", "items": ["Dark mode now uses local storage instead of cookies to save bandwidth and because local storage is cooler"]}, {"title": "Jinja Template Transition", "date": "2019-03-01T00:00:00Z", "items": ["Migrated Grade Checker and Menu over to Jinja for page generation", "Fixed a couple bugs related to error pages not displaying correctly and typos"]}, {"title": "Legacy Domain Banner", "date": "2019-03-04T00:00:00Z", "items": ["Added a banner to alert users entering through katzrkool.xyz of its deprecation"]}, {"title": "Updated Dark Mode", "date": "2019-03-28T00:00:00Z", "items": ["Updated dark mode on all services to now prioritize your preference of theme via the button on the site, higher than your system colors. This should have not much impact, but if you have set a preference (hit the dark mode button), the site will not react to your system preference."]}, {"title": "Fixed Menu Date Bug", "date": "2019-04-23T00:00:00Z", "items": ["Fixed a bug where if the api was hit, or the [Menu Shortcut](https://www.icloud.com/shortcuts/f5cb5dffd7264c97973363462ac2d279) was run after 12:00, it wouldn't give the next day's menu"]}, {"title": "The Great Viewport Revolution", "date": "2019-05-25T00:00:00Z", "items": ["Learned about the Viewport Meta tag, which improves the mobile mode for services that use it.", "Menu now uses Viewport Meta Tag", "Grades now uses Viewport Meta Tag", "Some parts of the main site use Viewport Meta Tag, I'm leaving the home page the way it is, because adding the tag doesn't use space efficiently"]}, {"title": "Shutdown Grade Checker", "date": "2019-06-03T00:00:00Z", "items": ["Grade Checker has been shut down, see [this page](https://lkellar.org/grades) for more info."]}, {"title": "Home Bar and Mobile Optimizations", "date": "2019-06-10T00:00:00Z", "items": ["Added a home bar to all sub pages applicable", "Made Tic Tac optimized for mobile", "Home page is now a single column view on mobile", "Removed the Shortcuts section"]}, {"title": "Shelf and Dark Mode Improvements", "date": "2019-06-12T00:00:00Z", "items": ["[New Service: Shelf!](https://lkellar.org/shelf) A place to temporarily store text without creating digital clutter.", "Dark mode now uses just media queries instead of the weird custom JS file I was using."]}, {"title": "License and Dark Mode Changes", "date": "2019-06-18T00:00:00Z", "items": ["Update dark mode on home page", "the whole site is now MIT licensed"]}, {"title": "Legacy Domain Banner", "date": "2019-09-16T00:00:00Z", "items": ["[New Service: Stocks!](https://lkellar.org/stocks) A visualizer for the Stock Market Game. Used to be private, now public!"]}, {"title": "Menu Relaunch", "date": "2019-09-28T00:00:00Z", "items": ["The New School Menu is back up with Sage Dining Support", "There's also a new Shortcut to get menu data! [Download Here](https://www.icloud.com/shortcuts/33b878254f1042e0808dcd4d114b759b) (Requires iOS 13 or higher)"]}, {"title": "Bug Fixes and Enhancements", "date": "2019-10-06T00:00:00Z", "items": ["Added dark mode to menu", "Fixed bug where \"&amp\" would appear in menu shortcut", "Now updating top/worst performer in stocks upon stock update", "Fixed bug with inaccurate fee calculation in stocks"]}, {"title": "Added Crime Map", "date": "2019-10-13T00:00:00Z", "items": ["[Julian Sanker](https://puffyboa.xyz/) and I made Crime Map, a tool to see recent 911 calls from Fayetteville, for the [2019 JB Hunt Hackathon](https://hackathon.jbhunt.com/home)"]}, {"title": "Menu Time Travel", "date": "2019-11-25T00:00:00Z", "items": ["Added ability to get weeks in the future or past on menu", "Similar functionality is now also available for the api, see docs"]}, {"title": "Shutdown Stock Market Game Dashboard", "date": "2020-01-14T00:00:00Z", "items": ["Shutdown the Stock Market Game Dashboard"]}, {"title": "Added Springdale to Crime Map!", "date": "2020-01-16T00:00:00Z", "items": ["Added Springdale calls from [their website](http://www.springdalear.gov/413/Dispatch-Logs). Still in beta though, so the icons won't be perfect yet (you'll see a lot of yellow triangles), and a few calls that are [10s or 100s of miles away from Springdale](https://github.com/katzrkool/maps/issues/13)"]}, {"title": "Added SOI Scheduler", "date": "2020-02-16T00:00:00Z", "items": ["Added [SOI Scheduler](https://lkellar.org/soischeduler) shortcut, a way to quickly add events to your calendar that happen during classes, like an exam.", "Also changed crime map description to include Springdale as well"]}, {"title": "Website Refresh", "date": "2020-03-13T00:00:00Z", "items": ["Redid the website! Now it has more pictures and looks a bit brighter", "Added an about page. It's pretty cool"]}, {"title": "Added Micro.blog and Changelog Feed", "date": "2020-03-21T22:24:46Z", "items": ["Created a Micro.blog at [https://micro.lkellar.org](https://micro.lkellar.org) for posting cat pictures and short thoughts", "Added a JSON Feed for this changelog, available at [https://lkellar.org/changelog/feed.json](https://lkellar.org/changelog/feed.json)"]}, {"title": "Changed Crime Map URL", "date": "2020-03-24T03:39:00Z", "items": ["Changed Crime Map URL to [crimemap.app](https://crimemap.app), hosted by [Julian Sanker](https://puffyboa.xyz)"]}, {"title": "Removed Micro.blog", "date": "2020-04-06T19:03:09Z", "items": ["Removed micro.blog and replaced it with changelog in the menu bar"]}, {"title": "Test", "date": "2020-04-11T21:55:06Z", "items": "1\n2"}]